; domain
(define (domain satellite)
  (:requirements :strips :equality :typing)
  (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:action turn-to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
           )
  )

 
  (:action switch-on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch-off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )


  (:action take-image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
               )
   :effect (have_image ?d ?m)
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image2 - mode
	image1 - mode
	image0 - mode
	image3 - mode
	Star3 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star1)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 image0)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star1)
	(supports instrument5 image2)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument6 image2)
	(supports instrument6 image1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 image3)
	(supports instrument7 image0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(pointing satellite1 Star1)
	(pointing satellite2 Phenomenon5)
	(have_image Phenomenon5 image0)
	(have_image Star6 image1)
	(have_image Star7 image0)
	(have_image Planet8 image0)
	(have_image Planet9 image3)
	(have_image Planet10 image0)
	(have_image Planet11 image2)
))

(:metric minimize (total-time))
)

; plan
1. (switch-on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 9
2. (turn-to satellite3 groundstation0 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 groundstation0)
   goals met: 0 of 9
3. (calibrate satellite3 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 0 of 9
4. (turn-to satellite3 planet9 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet9)
   goals met: 0 of 9
5. (take-image satellite3 planet9 instrument7 image3)
   added: (have_image planet9 image3)
   goals met: 1 of 9
6. (switch-on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 9
7. (turn-to satellite1 groundstation4 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 9
8. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 1 of 9
9. (turn-to satellite1 planet11 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet11)
   goals met: 1 of 9
10. (take-image satellite1 planet11 instrument3 image2)
   added: (have_image planet11 image2)
   goals met: 2 of 9
11. (turn-to satellite3 star6 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star6)
   goals met: 2 of 9
12. (take-image satellite3 star6 instrument7 image1)
   added: (have_image star6 image1)
   goals met: 3 of 9
13. (turn-to satellite3 planet10 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 planet10)
   goals met: 3 of 9
14. (take-image satellite3 planet10 instrument7 image0)
   added: (have_image planet10 image0)
   goals met: 4 of 9
15. (turn-to satellite3 phenomenon5 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon5)
   goals met: 4 of 9
16. (take-image satellite3 phenomenon5 instrument7 image0)
   added: (have_image phenomenon5 image0)
   goals met: 5 of 9
17. (turn-to satellite3 star7 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 star7)
   goals met: 5 of 9
18. (take-image satellite3 star7 instrument7 image0)
   added: (have_image star7 image0)
   goals met: 6 of 9
19. (turn-to satellite1 planet8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet8)
   goals met: 6 of 9
20. (take-image satellite1 planet8 instrument3 image0)
   added: (have_image planet8 image0)
   goals met: 7 of 9
21. (turn-to satellite1 star1 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star1)
   goals met: 8 of 9
22. (turn-to satellite2 phenomenon5 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon5)
   goals met: 9 of 9
